EDT/УТ/src/DataProcessors/РедактированиеГрафикаРейсов/РедактированиеГрафикаРейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РедактированиеГрафикаРейсов</name>
  <attributes>
    <name>ДатаРедактирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>тчГрафик</name>
    <attributes>
      <name>Т</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РольРейса</name>
      <type>
        <types>CatalogRef.РолиТранспорта</types>
      </type>
    </attributes>
    <attributes>
      <name>СменаПредыдущегоРейса</name>
      <type>
        <types>CatalogRef.Смены</types>
      </type>
    </attributes>
    <attributes>
      <name>Смена</name>
      <type>
        <types>CatalogRef.Смены</types>
      </type>
    </attributes>
    <attributes>
      <name>Транспорт</name>
      <type>
        <types>CatalogRef.новаТранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>Х</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Экспедитор</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
      </type>
    </attributes>
    <attributes>
      <name>Э</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтарыйВодитель</name>
      <type>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>СтарыйЭкспедитор</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоПериода</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортВыйдетВРейс</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МожноРедактировать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>РольДо</name>
      <type>
        <types>CatalogRef.РолиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифДо</name>
      <type>
        <types>CatalogRef.зпНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>РольПосле</name>
      <type>
        <types>CatalogRef.РолиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифПосле</name>
      <type>
        <types>CatalogRef.зпНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПеремещения</name>
      <type>
        <types>DocumentRef.КадровоеПеремещениеРаботниковОрганизаций</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

EDT/УТ/src/Enums/СостояниеРаботникаОрганизации/СостояниеРаботникаОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеРаботникаОрганизации</name>
  <enumValues>
    <name>ПринятНаРаботуВОрганизацию</name>
  </enumValues>
  <enumValues>
    <name>Уволен</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/DataProcessors/РедактированиеГрафикаРейсов/Forms/ФормаВыбораФизЛиц/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Список.РежимВыбора = Истина;
	
	ДатаРедактирования = Параметры.ДатаРедактирования;
	Терминал = Параметры.Терминал;
	
	Список.Параметры.УстановитьЗначениеПараметра("ДатаРедактирования", ДатаРедактирования);
	Список.Параметры.УстановитьЗначениеПараметра("Терминал", Терминал);
	Список.Параметры.УстановитьЗначениеПараметра("ВыбранныеФизЛица", Параметры.ВыбранныеФизЛица.ВыгрузитьЗначения());
	
	Список.Параметры.УстановитьЗначениеПараметра("Состояние", Перечисления.СостояниеРаботникаОрганизации.ПринятНаРаботуВОрганизацию);
	
	Если Не Параметры.ТекущийЭлемент.Пустая() Тогда
		Элементы.Список.ТекущаяСтрока = Параметры.ТекущийЭлемент;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УволенныеСотрудникиНаСервере()
	
	Элементы.СписокУволенныеСотрудники.Пометка = Не Элементы.СписокУволенныеСотрудники.Пометка;
	Если Элементы.СписокУволенныеСотрудники.Пометка Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Состояние", Перечисления.СостояниеРаботникаОрганизации.Уволен);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Состояние", Перечисления.СостояниеРаботникаОрганизации.ПринятНаРаботуВОрганизацию);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УволенныеСотрудники(Команда)
	УволенныеСотрудникиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ОповеститьОВыборе(Значение);
	
КонецПроцедуры
